# Intro to Pandas
by Ryan Orsinger

## Module 3: DataFrames Continued

### Pandas DataFrames Continued - Part 1
- Identifying and counting missing values
- Removing rows with missing information
- Filling missing values
- Dropping columns from a DataFrame
- Using `.loc` with DataFrames

In [1]:
import pandas as pd

In [3]:
# Preview our data
df = pd.read_csv("penguins.csv")
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [5]:

df.dtypes

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

In [9]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
 7   year               344 non-null    int64
dtypes: float64(4), int64(1), object(3)
memory usage: 21.6+ KB

In [11]:
# .isna() returns a boolean
df.isna().head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,True,True,True,True,True,False
4,False,False,False,False,False,False,False,False

In [12]:
# Counting the number of nulls by column
df.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [14]:
# Counting the number of nulls by row
# Recall that .sum can run on columns or by row, by row with axis=1
df.isna().sum(axis=1).head()

0    0
1    0
2    0
3    5
4    0
dtype: int64

In [19]:
# Get the proportion of null values by column
df.isna().mean()

species              0.000000
island               0.000000
bill_length_mm       0.005814
bill_depth_mm        0.005814
flipper_length_mm    0.005814
body_mass_g          0.005814
sex                  0.031977
year                 0.000000
dtype: float64

### Handling Missing Values
- There's no one right answer for all cases. It depends
- Sometimes, dropping rows with missing values makes sense.
- Other times, filling missing values can be helpful so we keep the other data.
    - this

In [ ]:
# Example of removing null values

In [ ]:
# Example of filling null values

- .isna
- .fillna
- .map for transforming values and/or normalizing values
- str.split() on a single column containing multiple columns of data (maybe move this to tidy data?)
- IQR range rule
- 3 sigma rule
- working with dates/datetime